Repository: klin34970/flutter-password
Catalog: lib/l10n/intl_*.arb
Languages: fr

# appName
source: Password Safe
fr: Coffre à mots de passe

# screensPasswordAddTitle
source: Add a password
fr: Ajouter un mot de passe

# screensPasswordEditTitle
source: Edit
fr: Modifier

# screensPasswordListTitle
source: List passwords
fr: Liste des mots de passe

# screensSettingsTitle
source: Settings
fr: Paramètres

# screensDevelopmentTitle
source: Development
fr: Développement

# listPasswordEdit
source: Edit
fr: Editer

# listPasswordDelete
source: Delete
fr: Supprimer

# listPasswordDeleteAlertTitle
source: Confirm deletion
fr: Confirmer la suppression

# listPasswordPasswordCopied
source: Password decrypted and copied
fr: Mot de passe décrypté et copié

# listPasswordLink
source: Visit link
fr: Visiter le lien

# formsPasswordSetPassWarning
source: Define a passphrase. It will be used to encrypt your password and it will be asked for each access to the application. Please choose your passphrase carefully. This action is irreversible.
fr: Définissez une phrase secrète. Elle sera utilisée pour crypter vos mots de passe et vous sera demandé à chaque accès à l'application. Merci de bien choisir votre phrase secrète. Cette action est irréversible.

# formsPasswordSetPassPhraseLabel
source: Choose a passphrase
fr: Choisissez une phrase secrète

# formsPasswordSetPassPhraseHint
source: Use to encrypt your password
fr: Utilisé pour crypter vos mot de passe

# formsPasswordSetPassPhraseEmpty
source: Passphrase is required.
fr: Phrase secrète est obligatoire.

# formsPasswordSetPassPhraseLenght
source: Passphrase must contain more than 8 characters.
fr: Phrase secrète doit contenir plus de 8 caractères.

# formsPassPhraseSetAuthHint
source: Enter your passphrase
fr: Entrer votre passphrase

# formsPasswordAddNameLabel
source: Choose a name
fr: Choisissez un nom

# formsPasswordAddNameHint
source: Easily find your password.
fr: Retrouver facilement votre mot de passe

# formsPasswordAddValidatorNameEmpty
source: Name is required.
fr: Nom est obligatoire.

# formsPasswordAddValidatorNameLenght
source: Name must contain more than 3 characters.
fr: Nom doit contenir plus de 3 caractères.

# formsPasswordAddCategoryHint
source: Easily find your password.
fr: Retrouver facilement votre mot de passe.

# formsPasswordAddCategoryLabel
source: Choose a category (optional)
fr: Choisissez une catégorie (optional)

# formsPasswordAddCategoryEmpty
source: No category created
fr: Aucune catégorie de crée

# formsPasswordAddWebsiteLabel
source: Webiste (optional)
fr: Site internet (optionel)

# formsPasswordAddWebsiteHint
source: Is the password linked to a website?
fr: Le mot de passe est-il lié à un site internet ?

# formsPasswordAddWebsiteValidatorUrl
source: Is not a valid domain name.
fr: Ceci n'est pas un nom de domaine valide.

# formsPasswordAddServiceLabel
source: Service (optional)
fr: Service (optionel)

# formsPasswordAddPasswordLabel
source: Password
fr: Mot de passe

# formsPasswordAddPasswordHint
source: The password will be encrypted (AES).
fr: Le mot de passe sera crypté (AES).

# formsPasswordAddValidatorPasswordEmpty
source: Password is required.
fr: Mot de passe est obligatoire.

# formsPasswordAddChangeColor
source: Change color
fr: Changer de couleur

# formsSettingsTimeoutLabel
source: Authentication request (minutes)
fr: Demande d'authentification (minutes)

# formsSettingsTimeoutHint
source: L'authentification sera demand√© tous les x minutes
fr: Authentication will be requested every x minutes

# formsSettingsTimeoutEmpty
source: Authentication request is required
fr: Demande d'authentification est obligatoire

# formsSettingsTimeoutNotLess
source: Authentication must be equal or higher than 1 minutes
fr: Demande d'authentification doit être égale ou supérieur à 1 minutes

# settingsScreenFormSaveScaffoldMessenger
source: Settings saved.
fr: Configurations sauvegardées.

# navDrawerSecondsLeft
source: s left
fr: s restantes

source: Save
fr: Sauvegarder

source: Connect
fr: Connexion

source: yes
fr: oui

source: no
fr: non
